# Необхідно створити функцію generator_numbers, яка буде аналізувати текст, ідентифікувати всі дійсні числа, що вважаються частинами доходів, і повертати їх як генератор. Дійсні числа у тексті записані без помилок, чітко відокремлені пробілами з обох боків. Також потрібно реалізувати функцію sum_profit, яка буде використовувати generator_numbers для підсумовування цих чисел і обчислення загального прибутку.

import re
from typing import Callable, Generator
 
def generator_numbers(text: str) -> Generator[float, None, None]:
    """
    Функція generator_numbers(text: str) знаходить по патерну всі дійсні числа у вхідному рядку text та повертає їх як генератор.
    """
    pattern = r'(?<= )\d+(?:\.\d+)?(?= )'
    for match in re.finditer(pattern, text): 
        yield float(match.group(0)) # yield використовується для створення генератора, який повертає знайдені числа по одному за раз. повертаэмо їх як float для подальших обчислень.

def sum_profit(text: str, func: Callable[[str], Generator[float, None, None]]) -> float:
    """
    Функція sum_profit(text: str, func: Callable) має використовувати функцію генератор для обчислення загальної суми чисел у вхідному рядку та приймати його як аргумент при виклику.
    Args:
        text (str): Вхідний текст, що містить дійсні числа.
        func (Callable): Функція-генератор, яка приймає рядок і повертає генератор дійсних чисел.
    Returns:
        float: Загальний дохід, обчислений як сума всіх дійсних чисел у тексті.
    """
    return sum(func(text)) # Використовуємо вбудовану функцію sum для підсумовування чисел, отриманих від генератора.

# Приклад використання
text = ("Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 167.67 і 224.00 доларів..")
total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_income}") # Загальний дохід: 1391.68


